{"format": "graph-model", "generatedBy": "1.15.0", "convertedBy": "TensorFlow.js Converter v1.4.0", "userDefinedMetadata": {"signature": {"outputs": {"generator_1/Tanh": {"name": "generator_1/Tanh"}}}}, "modelTopology": {"node": [{"name": "z", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "512"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/g_h0_lin/Matrix", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "131072"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/g_h0_lin/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "131072"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator_1/g_h1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/g_h1/w", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "256"}, {"size": "512"}]}}}}}, {"name": "generator_1/g_h2/conv2d_transpose/input_sizes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/g_h1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/g_h2/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/g_h2/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator_1/g_h3/conv2d_transpose/input_sizes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "generator/g_h3/w", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "generator/g_h3/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "generator_1/g_h4/conv2d_transpose/input_sizes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/g_h4/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/g_h4/biases", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "generator_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator_1/g_bn3/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator_1/g_bn3/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator_1/g_bn2/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator_1/g_bn2/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator_1/g_bn1/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator_1/g_bn1/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "generator_1/g_bn0/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "generator_1/g_bn0/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator_1/g_h0_lin/MatMul", "op": "MatMul", "input": ["z", "generator/g_h0_lin/Matrix"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator_1/g_h0_lin/add", "op": "AddV2", "input": ["generator/g_h0_lin/bias", "generator_1/g_h0_lin/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator_1/Reshape", "op": "Reshape", "input": ["generator_1/g_h0_lin/add", "generator_1/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator_1/g_bn0/FusedBatchNormV3/Mul", "op": "Mul", "input": ["generator_1/Reshape", "generator_1/g_bn0/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator_1/g_bn0/FusedBatchNormV3", "op": "Add", "input": ["generator_1/g_bn0/FusedBatchNormV3/Mul", "generator_1/g_bn0/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator_1/Relu", "op": "Relu", "input": ["generator_1/g_bn0/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator_1/g_h1/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["generator_1/g_h1/Reshape/shape", "generator/g_h1/w", "generator_1/Relu"], "attr": {"explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}}}, {"name": "generator_1/g_h1/BiasAdd", "op": "BiasAdd", "input": ["generator_1/g_h1/conv2d_transpose", "generator/g_h1/biases"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator_1/g_bn1/FusedBatchNormV3/Mul", "op": "Mul", "input": ["generator_1/g_bn1/FusedBatchNormV3/Scaled", "generator_1/g_h1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator_1/g_bn1/FusedBatchNormV3", "op": "Add", "input": ["generator_1/g_bn1/FusedBatchNormV3/Mul", "generator_1/g_bn1/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator_1/Relu_1", "op": "Relu", "input": ["generator_1/g_bn1/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator_1/g_h2/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["generator_1/g_h2/conv2d_transpose/input_sizes", "generator/g_h2/w", "generator_1/Relu_1"], "attr": {"data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator_1/g_h2/BiasAdd", "op": "BiasAdd", "input": ["generator_1/g_h2/conv2d_transpose", "generator/g_h2/biases"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator_1/g_bn2/FusedBatchNormV3/Mul", "op": "Mul", "input": ["generator_1/g_bn2/FusedBatchNormV3/Scaled", "generator_1/g_h2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator_1/g_bn2/FusedBatchNormV3", "op": "Add", "input": ["generator_1/g_bn2/FusedBatchNormV3/Mul", "generator_1/g_bn2/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator_1/Relu_2", "op": "Relu", "input": ["generator_1/g_bn2/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator_1/g_h3/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["generator_1/g_h3/conv2d_transpose/input_sizes", "generator/g_h3/w", "generator_1/Relu_2"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "generator_1/g_h3/BiasAdd", "op": "BiasAdd", "input": ["generator_1/g_h3/conv2d_transpose", "generator/g_h3/biases"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "generator_1/g_bn3/FusedBatchNormV3/Mul", "op": "Mul", "input": ["generator_1/g_bn3/FusedBatchNormV3/Scaled", "generator_1/g_h3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator_1/g_bn3/FusedBatchNormV3", "op": "Add", "input": ["generator_1/g_bn3/FusedBatchNormV3/Mul", "generator_1/g_bn3/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator_1/Relu_3", "op": "Relu", "input": ["generator_1/g_bn3/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator_1/g_h4/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["generator_1/g_h4/conv2d_transpose/input_sizes", "generator/g_h4/w", "generator_1/Relu_3"], "attr": {"explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "generator_1/g_h4/BiasAdd", "op": "BiasAdd", "input": ["generator_1/g_h4/conv2d_transpose", "generator/g_h4/biases"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "generator_1/Tanh", "op": "Tanh", "input": ["generator_1/g_h4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of69.bin", "group1-shard2of69.bin", "group1-shard3of69.bin", "group1-shard4of69.bin", "group1-shard5of69.bin", "group1-shard6of69.bin", "group1-shard7of69.bin", "group1-shard8of69.bin", "group1-shard9of69.bin", "group1-shard10of69.bin", "group1-shard11of69.bin", "group1-shard12of69.bin", "group1-shard13of69.bin", "group1-shard14of69.bin", "group1-shard15of69.bin", "group1-shard16of69.bin", "group1-shard17of69.bin", "group1-shard18of69.bin", "group1-shard19of69.bin", "group1-shard20of69.bin", "group1-shard21of69.bin", "group1-shard22of69.bin", "group1-shard23of69.bin", "group1-shard24of69.bin", "group1-shard25of69.bin", "group1-shard26of69.bin", "group1-shard27of69.bin", "group1-shard28of69.bin", "group1-shard29of69.bin", "group1-shard30of69.bin", "group1-shard31of69.bin", "group1-shard32of69.bin", "group1-shard33of69.bin", "group1-shard34of69.bin", "group1-shard35of69.bin", "group1-shard36of69.bin", "group1-shard37of69.bin", "group1-shard38of69.bin", "group1-shard39of69.bin", "group1-shard40of69.bin", "group1-shard41of69.bin", "group1-shard42of69.bin", "group1-shard43of69.bin", "group1-shard44of69.bin", "group1-shard45of69.bin", "group1-shard46of69.bin", "group1-shard47of69.bin", "group1-shard48of69.bin", "group1-shard49of69.bin", "group1-shard50of69.bin", "group1-shard51of69.bin", "group1-shard52of69.bin", "group1-shard53of69.bin", "group1-shard54of69.bin", "group1-shard55of69.bin", "group1-shard56of69.bin", "group1-shard57of69.bin", "group1-shard58of69.bin", "group1-shard59of69.bin", "group1-shard60of69.bin", "group1-shard61of69.bin", "group1-shard62of69.bin", "group1-shard63of69.bin", "group1-shard64of69.bin", "group1-shard65of69.bin", "group1-shard66of69.bin", "group1-shard67of69.bin", "group1-shard68of69.bin", "group1-shard69of69.bin"], "weights": [{"name": "generator/g_h0_lin/Matrix", "shape": [512, 131072], "dtype": "float32"}, {"name": "generator/g_h0_lin/bias", "shape": [131072], "dtype": "float32"}, {"name": "generator_1/g_h1/Reshape/shape", "shape": [4], "dtype": "int32"}, {"name": "generator/g_h1/w", "shape": [5, 5, 256, 512], "dtype": "float32"}, {"name": "generator_1/g_h2/conv2d_transpose/input_sizes", "shape": [4], "dtype": "int32"}, {"name": "generator/g_h1/biases", "shape": [256], "dtype": "float32"}, {"name": "generator/g_h2/w", "shape": [5, 5, 128, 256], "dtype": "float32"}, {"name": "generator/g_h2/biases", "shape": [128], "dtype": "float32"}, {"name": "generator_1/g_h3/conv2d_transpose/input_sizes", "shape": [4], "dtype": "int32"}, {"name": "generator/g_h3/w", "shape": [5, 5, 64, 128], "dtype": "float32"}, {"name": "generator/g_h3/biases", "shape": [64], "dtype": "float32"}, {"name": "generator_1/g_h4/conv2d_transpose/input_sizes", "shape": [4], "dtype": "int32"}, {"name": "generator/g_h4/w", "shape": [5, 5, 3, 64], "dtype": "float32"}, {"name": "generator/g_h4/biases", "shape": [3], "dtype": "float32"}, {"name": "generator_1/Reshape/shape", "shape": [4], "dtype": "int32"}, {"name": "generator_1/g_bn3/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "generator_1/g_bn3/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "generator_1/g_bn2/FusedBatchNormV3/Scaled", "shape": [128], "dtype": "float32"}, {"name": "generator_1/g_bn2/FusedBatchNormV3/Offset", "shape": [128], "dtype": "float32"}, {"name": "generator_1/g_bn1/FusedBatchNormV3/Scaled", "shape": [256], "dtype": "float32"}, {"name": "generator_1/g_bn1/FusedBatchNormV3/Offset", "shape": [256], "dtype": "float32"}, {"name": "generator_1/g_bn0/FusedBatchNormV3/Scaled", "shape": [512], "dtype": "float32"}, {"name": "generator_1/g_bn0/FusedBatchNormV3/Offset", "shape": [512], "dtype": "float32"}]}]}